src/cfe/КСП/Catalogs/мис_УправлениеЗаданиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>мис_УправлениеЗаданиями</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцедураСПараметрами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПроцедуры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПроцедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мис_УправлениеЗаданиями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтсутствияОтклика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовтораПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторовПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/мис_УправлениеЗаданиями/Forms/ФормаГруппы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		РасписаниеЗадания = Параметры.ЗначениеКопирования.Расписание.Получить();
		Если ТипЗнч(РасписаниеЗадания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
			//создаем новую переменную типа расписаниеРегламентногоЗаданя
			РасписаниеЗадания = мис_УправлениеЗаданиямиКлиентСервер.ИнициализацияРасписания();
		Иначе
			// проверяем расписание
			Если РасписаниеЗадания.ДниНедели = Неопределено ИЛИ РасписаниеЗадания.ДниНедели.Количество() = 0 Тогда
				Массив = Новый Массив;
				Для ин=1 По 7 Цикл
					Массив.Добавить(ин);
				КонецЦикла;
				РасписаниеЗадания.ДниНедели = Массив;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		// новый
		РасписаниеЗадания = мис_УправлениеЗаданиямиКлиентСервер.ИнициализацияРасписания();
	Иначе
		РасписаниеЗадания = СпрОбъект.Расписание.Получить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПараметрыЗаписи.Вставить("РасписаниеЗадания" ,РасписаниеЗадания);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Расписание = Новый ХранилищеЗначения(ПараметрыЗаписи.РасписаниеЗадания,Новый СжатиеДанных(9));
	УстановитьПривилегированныйРежим(Истина);
	мис_РегламентныеЗадания.ПередЗаписьюГруппыСправочникаЗаданий(ТекущийОбъект,ПараметрыЗаписи.РасписаниеЗадания);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьРасписаниеНажатие(Элемент)
	
	Если ТипЗнч(РасписаниеЗадания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		//создаем новую переменную типа расписаниеРегламентногоЗаданя
		РасписаниеЗадания = мис_УправлениеЗаданиямиКлиентСервер.ИнициализацияРасписания();
	КонецЕсли;
	
	Асинк = Новый ОписаниеОповещения("Асинк_НадписьОткрытьРасписаниеНажатие", ЭтотОбъект);
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	Диалог.Показать(Асинк);

КонецПроцедуры

&НаКлиенте
Процедура Асинк_НадписьОткрытьРасписаниеНажатие(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено  Тогда
		РасписаниеЗадания = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПоРасписаниюПриИзменении(Элемент)
	Объект.Активность = Объект.ЗапускПоРасписанию;
КонецПроцедуры
